# Rebar Free Form Creation Result Error Property

Source: https://www.revitapidocs.com/2026/26ca2de6-8aed-d403-642c-01071c432ce7.htm

---

| Rebar Free Form Creation Result Error Property |
| --- |

Identifies the error that occurs during the operation. Will be Success if everything is ok, otherwise the failure reason.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarFreeFormValidationResult Error { get; }
```

```
Public ReadOnly Property Error As RebarFreeFormValidationResult
	Get
```

```
public:
property RebarFreeFormValidationResult Error {
	RebarFreeFormValidationResult get ();
}
```

```
member Error : RebarFreeFormValidationResult with get
```

#### Property Value

RebarFreeFormValidationResult See Also

#### Reference

RebarFreeFormCreationResult Class Autodesk.Revit.DB.Structure Namespace